Autodesk.Revit.DB.Structure.StructuralConnectionsProviderRegistry.RegisterConnectionsProvider(Autodesk.Revit.DB.Structure.IStructuralConnectionsProvider)
Registers a connections provider.
provider:
Structural Connections Provider to be registered.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The provider object is not valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
There is already registered Connections Provider.
Since:
2017